Revit 2027 API
PipeSystemType Enumeration
 An enumerated type listing all the possible pipe system types for a connector object.
Namespace: Autodesk.Revit.DB.Plumbing
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public enum PipeSystemType
Public Enumeration PipeSystemType
public enum class PipeSystemType
type PipeSystemType
Members
Member name | Value | Description
DomesticColdWater | 20 |  Pipe System Type is DomesticColdWater.
DomesticHotWater | 19 |  Pipe System Type is DomesticHotWater.
FireProtectDry | 24 |  Pipe System Type is FireProtectDry.
FireProtectOther | 26 |  Pipe System Type is FireProtectOther.
FireProtectPreaction | 25 |  Pipe System Type is FireProtectPreaction.
FireProtectWet | 23 |  Pipe System Type is FireProtectWet.
Fitting | 28 |  Pipe System Type is Fitting.
Global | 29 |  Pipe System Type is Global.
OtherPipe | 22 |  Pipe System Type is OtherPipe.
ReturnHydronic | 8 |  Pipe System Type is ReturnHydronic.
Sanitary | 16 |  Pipe System Type is Sanitary.
SupplyHydronic | 7 |  Pipe System Type is SupplyHydronic.
UndefinedSystemType | 0 |  Pipe System Type is UndefinedSystemClassification.
Vent | 17 |  Pipe System Type is Vent.
See Also
Reference
Autodesk.Revit.DB.Plumbing Namespace